tap "sinelaw/fresh"
tap "theboredteam/boring-notch"
# Download with resuming and segmented downloading
brew "aria2"
# Console Matrix
brew "cmatrix"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Text editor for your terminal: easy, powerful and fast
brew "fresh-editor"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU grep, egrep and fgrep
brew "grep"
# Simple terminal UI for git commands
brew "lazygit"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Enable Windows-like alt-tab
cask "alt-tab"
# Not so boring notch That Rocks 🎸🎶 
cask "theboredteam/boring-notch/boring-notch"
cask "font-meslo-lg-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "davidmorais.dark-magic-themes"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "jaakko.black"
vscode "lewxdev.vscode-glyph"
vscode "max-ss.cyberpunk"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.live-server"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "nichabosh.minimalist-dark"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "smnatale.tokyodark"
vscode "teabyii.ayu"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
